Update diagram in specification to improve clarity on how dot text becomes a program
